; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; 4 Op-blocks world
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain BLOCKS)
  (:requirements :strips)
  (:predicates (on ?o1 ?o2)
	       (ontable ?o1)
	       (clear ?o1)
	       (handempty)
	       (holding ?o1)
	       )

  (:action pick-up
	     :parameters (?o1)
	     :precondition (and (clear ?o1) (ontable ?o1) (handempty))
	     :effect
	     (and (not (ontable ?o1))
		   (not (clear ?o1))
		   (not (handempty))
		   (holding ?o1)))

  (:action put-down
	     :parameters (?o1)
	     :precondition (and (holding ?o1))
	     :effect
	     (and (not (holding ?o1))
		   (clear ?o1)
		   (handempty)
		   (ontable ?o1)))
  (:action stack
	     :parameters (?o1 ?o2)
	     :precondition (and (holding ?o1) (clear ?o2))
	     :effect
	     (and (not (holding ?o1))
		   (not (clear ?o2))
		   (clear ?o1)
		   (handempty)
		   (on ?o1 ?o2)))
  (:action unstack
	     :parameters (?o1 ?o2)
	     :precondition (and (on ?o1 ?o2) (clear ?o1) (handempty))
	     :effect
	     (and (holding ?o1)
		   (clear ?o2)
		   (not (clear ?o1))
		   (not (handempty))
		   (not (on ?o1 ?o2)))))

; problem
(define (problem blocks-7-1)
  (:domain blocks)
  (:objects b -  object d -  object f -  object e -  object c -  object g -  object a -  object )
  (:init (on b e) (on e f) (ontable g) (on d b) (on c d) (clear c) (handempty ) (ontable f) (clear a) (on a g) )
  (:goal (and (on e f)(ontable g)(ontable f)(clear a)(on a g)(clear c)(ontable c)(clear d)(ontable d)(holding b)(clear e)(not (on e e))(not (on e b))(not (on e d))(not (on e g))(not (on e c))(not (on e a))(not (on b e))(not (on b b))(not (on b d))(not (on b f))(not (on b g))(not (on b c))(not (on b a))(not (on d e))(not (on d b))(not (on d d))(not (on d f))(not (on d g))(not (on d c))(not (on d a))(not (on f e))(not (on f b))(not (on f d))(not (on f f))(not (on f g))(not (on f c))(not (on f a))(not (on g e))(not (on g b))(not (on g d))(not (on g f))(not (on g g))(not (on g c))(not (on g a))(not (on c e))(not (on c b))(not (on c d))(not (on c f))(not (on c g))(not (on c c))(not (on c a))(not (on a e))(not (on a b))(not (on a d))(not (on a f))(not (on a c))(not (on a a))(not (ontable e))(not (ontable b))(not (ontable a))(not (clear b))(not (clear f))(not (clear g))(not (handempty ))(not (holding e))(not (holding d))(not (holding f))(not (holding g))(not (holding c))(not (holding a)))))

; plan
1. (unstack c d)
   deleted: (clear c) (handempty) (on c d)
   added: (holding c) (clear d)
   goals met: 63 of 71
2. (put-down c)
   deleted: (holding c)
   added: (clear c) (handempty) (ontable c)
   goals met: 65 of 71
3. (unstack d b)
   deleted: (clear d) (handempty) (on d b)
   added: (holding d) (clear b)
   goals met: 64 of 71
4. (put-down d)
   deleted: (holding d)
   added: (clear d) (handempty) (ontable d)
   goals met: 66 of 71
5. (unstack b e)
   deleted: (clear b) (handempty) (on b e)
   added: (holding b) (clear e)
   goals met: 71 of 71
